RhinoInside.Revit API Documentation
GeometryDecoder.ToPoint2d Method
 Converts the specified Autodesk.Revit.DB.UV to an equivalent Rhino.Geometry.Point2d.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8026
Syntax
public static Rhino.Geometry.Point2d ToPoint2d(
	this Autodesk.Revit.DB.UV uvPoint
)
@staticmethod
def ToPoint2d(
	uvPoint: Autodesk.Revit.DB.UV
) -> Rhino.Geometry.Point2d
Parameters
uvPoint
Type: Autodesk.Revit.DB.UV
Revit uvPoint to convert.
Return Value
Type: Rhino.Geometry.Point2d
Rhino point that is equivalent to the provided Revit uvPoint.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.UV. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToPoint2d(UV) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Point2d rhinoPoint2d = revitUvPoint.ToPoint2d();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_point2d = revit_uvpoint.ToPoint2d() # type: RG.Point2d
 Using ToPoint2d(UV) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Point2d rhinoPoint2d = GeometryEncoder.ToPoint2d(revitUvPoint)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_point2d = GD.ToPoint2d(revit_uvpoint) # type: RG.Point2d
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace